Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: This guide covers the Dev UI v1, which has been replaced in Quarkus 3 with xref:dev-ui-v2.adoc[a new Dev UI]. You can still access the Dev UI v1 using http://localhost:8080/q/dev-v1[/q/dev-v1]
ja_jp: このガイドでは、Quarkus 3で新しい xref:dev-ui-v2.adoc[Dev UI] に置き換えられたDev UI v1について説明します。dev UI v1には、 http://localhost:8080/q/dev-v1[/q/dev-v1] を使用してアクセスできます。

source: This guide covers the Dev UI v2, which is the default from Quarkus 3 onwards.
ja_jp: このガイドでは、Quarkus 3以降のデフォルトであるDev UI v2について説明します。

source: This guide covers the Quarkus Dev UI for xref:building-my-first-extension.adoc[extension authors].
ja_jp: このガイドでは、 link:building-my-first-extension.html[エクステンションの作成者]向けにQuarkus Dev UIについて説明します。

source: This guide covers the systems integration with Apache Camel
ja_jp: このガイドでは、Apache Camel でのシステム統合について説明します

source: This guide covers the usage of MongoDB using active records and repositories in a Kotlin project.
ja_jp: このガイドでは、Kotlinプロジェクトでアクティブレコードやリポジトリを使ったMongoDBの使い方について説明します。

source: This guide covers the usage of MongoDB using active records and repositories.
ja_jp: このガイドでは、アクティブなレコードやリポジトリを使ったMongoDBの使い方について説明します。

source: This guide covers:
ja_jp: このガイドでは以下をカバーしています:

source: This guide covers: * Gradle configuration * Creating a new project * Dealing with extensions * Development mode * Debugging * Import in your IDE * Building a native executable * Build a container friendly executable
ja_jp: このガイドは以下の内容をカバーしています。 * Gradle の設定 * 新規プロジェクトの作成 * エクステンションの扱い * 開発モード * デバッグ * IDE でのインポート * ネイティブイメージのビルド * コンテナフレンドリーな実行可能ファイルのビルド

source: This guide covers: * Maven configuration * Creating a new project * Dealing with extensions * Development mode * Debugging * Import in your IDE * Building a native executable * Build a container friendly executable
ja_jp: このガイドでは、以下の内容について説明します。 * Maven の設定 * 新しいプロジェクトの作成 * エクステンションの扱い * 開発モード * デバッグ * IDE でのインポート * ネイティブイメージのビルド * コンテナフレンドリーな実行可能ファイルのビルド

source: This guide covers: * Testing in JVM mode * Testing in native mode * Injection of resources into tests
ja_jp: このガイドでは、以下の内容をカバーしています： * JVM モードでのテスト * ネイティブモードでのテスト * テストへのリソースの注入

source: This guide covers: Gradle configuration, creating a new project, dealing with extensions, development mode, debugging, import in your IDE, building a native image, and build a container friendly executable
ja_jp: このガイドでは、次をカバーします：Gradleの設定、新しいプロジェクトの作成、エクステンションの扱い、開発モード、デバッグ、IDEでのインポート、ネイティブイメージのビルド、コンテナに適した実行可能ファイルのビルド

source: This guide covers: Maven configuration, creating a new project, dealing with extensions, development mode, debugging, import in your IDE, building a native image, and build a container friendly executable
ja_jp: このガイドでは、次をカバーします：Mavenの設定、新規プロジェクトの作成、エクステンションの扱い、開発モード、デバッグ、IDEでのインポート、ネイティブイメージのビルド、コンテナに適した実行可能ファイルのビルド

source: This guide demonstrates how to add a RESTEasy Reactive filter to help prevent CSRF attacks.
ja_jp: このガイドでは、CSRF攻撃からの保護を助けるRESTEasy Reactive filterを追加する方法をデモします。

source: This guide demonstrates how to get started with Quarkus security using Basic authentication and a database to store your user identities with Hibernate ORM.
ja_jp: このガイドでは、Basic認証と、Hibernate ORMを使用してユーザーIDを保存するデータベースを使用したQuarkus security入門です。

source: This guide demonstrates how to use Quarkus OpenID Connect (OIDC) Extension to protect your JAX-RS applications using Bearer Token Authorization where Bearer Tokens are issued by OpenID Connect and OAuth 2.0 compliant Authorization Servers such as https://www.keycloak.org[Keycloak].
ja_jp: このガイドでは、Quarkus OpenID Connect (OIDC) Extensionを使用して、ベアラートークンがOpenID Connectや link:https://www.keycloak.org[Keycloak] などのOAuth 2.0準拠の認可サーバーによって発行されるベアラートークン認可を使用して、JAX-RSアプリケーションを保護する方法を説明します。

source: This guide demonstrates how to use Quarkus OpenID Connect (OIDC) Extension to protect your Quarkus HTTP endpoints using OpenID Connect Authorization Code Flow supported by OpenID Connect compliant Authorization Servers such as https://www.keycloak.org[Keycloak].
ja_jp: このガイドでは、Quarkus OpenID Connect (OIDC) Extension を使用して、 link:https://www.keycloak.org/[Keycloak] などのOpenID Connect準拠の認証サーバーでサポートされている OpenID Connect 認可コードフローを使用して Quarkus HTTP エンドポイントを保護する方法を説明します。

source: This guide demonstrates how to use reactive routes.
ja_jp: このガイドでは、リアクティブルートの使用方法を説明します。

source: This guide demonstrates how to use the Fabric8 Kubernetes client to interact with your Kubernetes cluster.
ja_jp: このガイドでは、Fabric8 Kubernetes クライアントを使用して Kubernetes クラスタと対話する方法を説明します。

source: This guide demonstrates how to use the OpenID Connect Extension to protect your web application based on the Authorization Code Flow using Quarkus.
ja_jp: このガイドでは、Quarkusを使用してAuthorization Code Flowに基づいてWebアプリケーションを保護するためにOpenID Connect Extensionを使用する方法を説明します。

source: This guide demonstrates how to use the OpenID Connect extension to protect your Quarkus JAX-RS service application using Bearer Token Authorization where the tokens are issued by OpenID Connect Providers such as Keycloak.
ja_jp: このガイドでは、OpenID Connectエクステンションを使用して、KeycloakなどのOpenIdConnectプロバイダーによってトークンが発行されるベアラートークン認可を使用してQuarkusJAX-RSサービスアプリケーションを保護する方法を示します。

source: This guide demonstrates how to use the OpenID Connect extension to protect your Quarkus JAX-RS service application using Bearer Token Authorization where the tokens are issued by OpenId Connect Providers such as Keycloak.
ja_jp: このガイドでは、OpenID Connectエクステンションを使用して、KeycloakなどのOpenId Connectプロバイダによってトークンが発行されるベアラートークン認可を使って、Quarkus JAX-RSサービスアプリケーションを保護する方法を示します。

source: This guide demonstrates how to use the OpenID Connect extension to protect your Quarkus JAX-RS web application using the Authorization Code Flow and OpenID Connect Providers such as Keycloak.
ja_jp: このガイドでは、OpenID Connect エクステンションを使用して、Authorization Code Flow と Keycloak などの OpenID Connect プロバイダーを使用して Quarkus JAX-RS Web アプリケーションを保護する方法を示します。

source: This guide demonstrates how to use the OpenID Connect extension to protect your Quarkus JAX-RS web application using the Authorization Code Flow and OpenId Connect Providers such as Keycloak.
ja_jp: このガイドでは、OpenID Connectエクステンションを使用して、認可コードフローとKeycloakなどのOpenId Connectプロバイダを使用して、Quarkus JAX-RS Webアプリケーションを保護する方法を示します。

source: This guide demonstrates how you can leverage the xref:cdi-reference.adoc[Quarkus ArC] and inject the admin client to your Quarkus application, as well as how to create it directly in the application code.
ja_jp: このガイドでは、 link:cdi-reference.html[Quarkus ArC] を活用して、Quarkusアプリケーションに管理者クライアントを注入する方法と、アプリケーションコードで直接作成する方法について説明します。

source: This guide demonstrates how your OpenID Connect (OIDC) application can support multi-tenancy so that you can serve multiple tenants from a single application. Tenants can be distinct realms or security domains within the same OpenID Provider or even distinct OpenID Providers.
ja_jp: このガイドでは、OpenID Connect (OIDC) アプリケーションがマルチテナンシーをサポートして、単一のアプリケーションから複数のテナントにサービスを提供する方法を説明します。テナントは、同じ OpenID プロバイダー内の個別のレルムまたはセキュリティードメイン、あるいは個別の OpenID プロバイダーです。

source: This guide demonstrates how your OpenID Connect (OIDC) application can support multitenancy to serve multiple tenants from a single application.
ja_jp: このガイドでは、OpenID Connect（OIDC）アプリケーションがマルチテナントをサポートし、単一のアプリケーションから複数のテナントにサービスを提供する方法を示します。

source: This guide demonstrates how your OpenID Connect (OIDC) application can support multitenancy to serve multiple tenants from a single application. These tenants can be distinct realms or security domains within the same OIDC provider or even distinct OIDC providers.
ja_jp: このガイドでは、OpenID Connect (OIDC) アプリケーションがマルチテナントをサポートして、単一のアプリケーションから複数のテナントにサービスを提供する方法を説明します。 これらのテナントは、同じ OIDC プロバイダー内の異なるレルムまたはセキュリティードメイン、あるいは異なる OIDC プロバイダーである場合もあります。

source: This guide demonstrates how your OpenID Connect application can support multi-tenancy so that you can serve multiple tenants from a single application.
ja_jp: このガイドでは、単一のアプリケーションから複数のテナントにサービスを提供できるように、OpenID Connectアプリケーションがマルチテナントをサポートする方法を示します。

source: This guide demonstrates how your Quarkus application can authorize a bearer token access to protected resources using https://www.keycloak.org/docs/latest/authorization_services/index.html[Keycloak Authorization Services].
ja_jp: このガイドでは、Quarkusアプリケーションが link:https://www.keycloak.org/docs/latest/authorization_services/index.html[Keycloak Authorization Services] を使用して保護されたリソースへのベアラートークンアクセスを認証する方法を説明します。

source: This guide demonstrates how your Quarkus application can authorize access to protected resources using Keycloak Authorization Services.
ja_jp: このガイドでは、QuarkusアプリケーションがKeycloak認可サービスを使用して保護されたリソースへのアクセスを認可する方法を説明します。

source: This guide demonstrates how your Quarkus application can collect metrics using the Micrometer extension.
ja_jp: このガイドでは、QuarkusアプリケーションがMicrometerエクステンションを使用してメトリクスを収集する方法を説明します。

source: This guide demonstrates how your Quarkus application can connect to a Redis server using the Redis Client extension.
ja_jp: このガイドでは、QuarkusアプリケーションがRedisクライアントエクステンションを使用してRedisサーバーに接続する方法を説明します。

source: This guide demonstrates how your Quarkus application can connect to an Infinispan server using the Infinispan Client extension.
ja_jp: このガイドでは、Infinispan Clientエクステンションを使用して、QuarkusアプリケーションをInfinispanサーバーに接続する方法について説明します。

source: This guide demonstrates how your Quarkus application can send emails using an SMTP server. This is a getting started guide. Check the xref:mailer-reference.adoc[Quarkus Mailer Reference documentation] for more complete explanation about the mailer and its usage.
ja_jp: このガイドでは、QuarkusアプリケーションがSMTPサーバーを使用して電子メールを送信する方法を説明します。このガイドは入門編です。mailerの詳細やその使用方法については、 link:mailer-reference.html[Quarkus Mailer リファレンスドキュメント]をご確認ください。

source: This guide demonstrates how your Quarkus application can use JMS messaging via the Apache Qpid JMS AMQP client, or alternatively the Apache ActiveMQ Artemis JMS client.
ja_jp: このガイドでは、QuarkusアプリケーションがApache Qpid JMS AMQPクライアント、またはApache ActiveMQ Artemis JMSクライアントを介してJMSメッセージングを使用する方法を説明します。

source: This guide demonstrates how your Quarkus application can use JMS messaging with AMQP 1.0 using Apache Qpid JMS, or using Apache ActiveMQ Artemis JMS.
ja_jp: このガイドでは、Quarkusアプリケーションが、Apache Qpid JMSを使用してAMQP 1.0でJMSメッセージングを使用する方法、またはApache ActiveMQ Artemis JMSを使用する方法を説明します。

source: This guide demonstrates how your Quarkus application can use Keycloak to protect your JAX-RS applications using bearer token authorization, where these tokens are issued by a Keycloak server.
ja_jp: このガイドでは、QuarkusアプリケーションがKeycloakを使用して、ベアラートークン認可を使用してJAX-RSアプリケーションを保護する方法を説明します。

source: This guide demonstrates how your Quarkus application can use Kogito to add DRL files with rules.
ja_jp: このガイドでは、QuarkusアプリケーションがKogitoを使用してルール付きのDRLファイルを追加する方法を説明します。

source: This guide demonstrates how your Quarkus application can use Kogito to add business automation and power it up with DMN decision support.
ja_jp: このガイドでは、QuarkusアプリケーションがKogitoを使用してビジネスオートメーションを追加し、DMN意思決定サポートでパワーアップする方法を説明します。

source: This guide demonstrates how your Quarkus application can use Kogito to add business automation to power it up with business processes and rules.
ja_jp: このガイドでは、QuarkusアプリケーションがKogitoを使用してビジネスオートメーションを追加し、ビジネスプロセスとルールでパワーアップする方法を説明します。

source: This guide demonstrates how your Quarkus application can use Kogito to add business automation to power it up with predictions.
ja_jp: このガイドでは、QuarkusアプリケーションがKogitoを使用してビジネスオートメーションを追加し、予測機能を強化する方法について説明します。

source: This guide demonstrates how your Quarkus application can use WebAuthn authentication instead of passwords.
ja_jp: このガイドでは、Quarkus アプリケーションで、パスワードの代わりに WebAuthn 認証を使用する方法を説明します。

source: This guide demonstrates how your Quarkus application can use a .properties file to store your user identities.
ja_jp: このガイドでは、Quarkusアプリケーションが.propertiesファイルを使用してユーザーIDを保存する方法を説明します。

source: This guide demonstrates how your Quarkus application can use a LDAP directory to store your user identities.
ja_jp: このガイドでは、QuarkusアプリケーションがLDAPディレクトリを使用してユーザーIDを保存する方法を説明します。

source: This guide demonstrates how your Quarkus application can use a database to store your user identities with xref:hibernate-orm.adoc[Hibernate ORM] or xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache].
ja_jp: このガイドでは、 xref:hibernate-orm.adoc[Hibernate ORM] または xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache] を使用して、Quarkusアプリケーションでデータベースを使用してユーザーIDを保存する方法を示します。

source: This guide demonstrates how your Quarkus application can use a database to store your user identities with Hibernate ORM.
ja_jp: このガイドでは、Quarkusアプリケーションがデータベースを使用してHibernate ORMを使用してユーザーIDを保存する方法を説明します。

source: This guide demonstrates how your Quarkus application can use a database to store your user identities.
ja_jp: このガイドでは、Quarkusアプリケーションがデータベースを使用してユーザーIDを保存する方法を説明します。

source: This guide demonstrates how your Quarkus application can use an LDAP server to authenticate and authorize your user identities.
ja_jp: このガイドでは、QuarkusアプリケーションがLDAPサーバーを使用してユーザーアイデンティティを認証・認可する方法を説明します。

source: This guide demonstrates how your Quarkus application can use https://github.com/smallrye/smallrye-graphql/[SmallRye GraphQL], an implementation of the https://github.com/eclipse/microprofile-graphql/[MicroProfile GraphQL] specification.
ja_jp: このガイドでは、 link:https://github.com/eclipse/microprofile-graphql/[MicroProfile GraphQL] 仕様の実装である link:https://github.com/smallrye/smallrye-graphql/[SmallRye GraphQL] をQuarkusアプリケーションで使用する方法を説明します。

source: This guide demonstrates how your Quarkus application can use https://github.com/smallrye/smallrye-health/[SmallRye Health] an implementation of the https://github.com/eclipse/microprofile-health/[MicroProfile Health] specification.
ja_jp: このガイドでは、 link:https://github.com/eclipse/microprofile-health/[MicroProfile Health]仕様の実装である link:https://github.com/smallrye/smallrye-health/[SmallRye Health]をQuarkusアプリケーションで使用する方法を説明します。

source: This guide demonstrates how your Quarkus application can use https://www.drools.org[Drools] to add intelligent automation and power it up with the Drools rule engine.
ja_jp: このガイドでは、Quarkus アプリケーションが https://www.drools.org[Drools] を活用してインテリジェントな自動化を実現し、Drools ルールエンジンで強化する方法を紹介します。

source: This guide demonstrates how your Quarkus application can use the GraphQL client library. The client is implemented by the https://github.com/smallrye/smallrye-graphql/[SmallRye GraphQL] project. This guide is specifically geared towards the client side, so if you need an introduction to GraphQL in general, first refer to the xref:smallrye-graphql.adoc[SmallRye GraphQL guide], which provides an introduction to the GraphQL query language, general concepts and server-side development.
ja_jp: このガイドでは、QuarkusアプリケーションでGraphQLクライアントライブラリを使用する方法を説明します。このクライアントは、 https://github.com/smallrye/smallrye-graphql/[SmallRye GraphQL] プロジェクトによって実装されています。このガイドは特にクライアント側を対象としていますので、GraphQL全般の紹介が必要な場合は、まず link:smallrye-graphql.html[SmallRye GraphQLガイド]を参照してください。このガイドでは、GraphQLのクエリ言語、一般的なコンセプト、サーバーサイドの開発について紹介しています。

source: This guide demonstrates how your Quarkus application can utilize Quarkus Messaging to interact with AMQP 1.0.
ja_jp: このガイドでは、QuarkusアプリケーションがQuarkus Messagingを利用してAMQP 1.0とやり取りする方法を示します。

source: This guide demonstrates how your Quarkus application can utilize Quarkus Messaging to interact with AMQP.
ja_jp: このガイドでは、QuarkusアプリケーションがQuarkus Messagingを利用してAMQPとやり取りする方法を示します。

source: This guide demonstrates how your Quarkus application can utilize Quarkus Messaging to interact with Apache Kafka.
ja_jp: このガイドでは、QuarkusアプリケーションがQuarkus Messagingを利用してApache Kafkaとやり取りする方法を示します。

source: This guide demonstrates how your Quarkus application can utilize Quarkus Messaging to interact with Apache Pulsar.
ja_jp: このガイドでは、QuarkusアプリケーションがQuarkus Messagingを利用してApache Pulsarとやりとりする方法を示します。

source: This guide demonstrates how your Quarkus application can utilize Quarkus Messaging to interact with RabbitMQ.
ja_jp: このガイドでは、QuarkusアプリケーションがQuarkus Messagingを利用してRabbitMQとやり取りする方法を示します。

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to consume and produce HTTP messages.
ja_jp: このガイドでは、Quarkus アプリケーションが MicroProfile Reactive Messaging を使用して HTTP メッセージを消費および生成する方法を説明します。

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to consume and produce messages via WebSockets.
ja_jp: このガイドでは、QuarkusアプリケーションがSmallRye Reactive Messagingを使用してWebSocketsでメッセージを消費、生成する方法を説明します。

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with AMQP 1.0.
ja_jp: このガイドでは、Quarkus アプリケーションがSmallRye Reactive Messaging を利用して AMQP 1.0 と対話する方法を説明します。

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with AMQP.
ja_jp: このガイドでは、QuarkusアプリケーションがSmallRye Reactive Messagingを使用してAMQPと対話する方法を説明します。

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with Apache Kafka.
ja_jp: このガイドでは、Quarkus アプリケーションが SmallRye Reactive Messaging を利用して Apache Kafka とやりとりする仕組みを説明します。

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with Apache Pulsar.
ja_jp: このガイドでは、QuarkusアプリケーションがSmallRye Reactive Messagingを利用してApache Pulsarと対話する方法を説明します。

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with RabbitMQ.
ja_jp: このガイドでは、QuarkusアプリケーションがSmallRye Reactive Messagingを利用してRabbitMQと対話する方法を説明します。

source: This guide demonstrates how your Quarkus application can utilize the Apache Kafka Streams API to implement stream processing applications based on Apache Kafka.
ja_jp: このガイドでは、QuarkusアプリケーションでApache Kafka Streams APIを利用して、Apache Kafkaをベースにしたストリーム処理アプリケーションを実装する方法を説明します。

source: This guide demonstrates how your Quarkus application can utilize the Micrometer metrics library for runtime and application metrics.
ja_jp: このガイドでは、QuarkusアプリケーションがランタイムメトリクスとアプリケーションメトリクスのためにMicrometerメトリクスライブラリを利用する方法を説明します。

source: This guide demonstrates how your Quarkus application can utilize the SmallRye Fault Tolerance extension.
ja_jp: このガイドでは、QuarkusアプリケーションがSmallRye Fault Toleranceエクステンションを使用する方法を説明します。

source: This guide demonstrates how your Quarkus application can utilize the SmallRye Fault Tolerance specification through the SmallRye Fault Tolerance extension.
ja_jp: このガイドでは、QuarkusアプリケーションがSmallRye Fault Toleranceエクステンションを使用してSmallRye Fault Tolerance仕様を使用する方法を説明します。

source: This guide demonstrates how your Quarkus application can utilize the SmallRye Health extension.
ja_jp: このガイドでは、QuarkusアプリケーションがSmallRye Healthエクステンションを使用する方法を説明します。

source: This guide demonstrates how your Quarkus application can utilize the SmallRye Metrics extension.
ja_jp: このガイドでは、QuarkusアプリケーションがSmallRye Metricsエクステンションを使用する方法を説明します。

source: This guide describes Quarkus SBOM generation capabilities following https://cyclonedx.org/[CycloneDX] specification.
ja_jp: このガイドでは、 https://cyclonedx.org/[CycloneDX] 仕様に準拠した Quarkus SBOM 生成機能について説明します。

source: This guide describes how to build and deploy a Quarkus application on OpenShift by using Source-to-Image (S2I).
ja_jp: このガイドでは、Source-to-Image（S2I）を使用してOpenShift上でQuarkusアプリケーションをビルドしてデプロイする方法を説明します。

source: This guide describes how to build and deploy a Quarkus application on OpenShift by using the Docker build strategy.
ja_jp: このガイドでは、Dockerビルドストラテジーを使用してOpenShift上でQuarkusアプリケーションをビルドしてデプロイする方法を説明します。

source: This guide describes how to build and deploy a Quarkus application to OpenShift in a single step.
ja_jp: このガイドでは、QuarkusアプリケーションをワンステップでビルドしてOpenShiftにデプロイする方法を説明します。

source: This guide describes how to deploy a Quarkus application to OpenShift compiled to native executables.
ja_jp: このガイドでは、ネイティブ実行可能ファイルにコンパイルされた Quarkus アプリケーションを OpenShift にデプロイする方法について説明します。

source: This guide describes the asciidoc format and conventions that Quarkus has adopted.
ja_jp: このガイドでは、Quarkusが採用しているasciidocフォーマットと規約について説明します。

source: This guide describes the deployment of Quarkus applications to OpenShift.
ja_jp: このガイドでは、QuarkusアプリケーションのOpenShiftへのデプロイについて説明します。

source: This guide describes this strategy by using a Quarkus project with Maven as the example project.
ja_jp: このガイドでは、Maven を使用した Quarkus プロジェクトを例として使用して、この戦略について説明します。

source: This guide explains Funqy's AWS Lambda HTTP binding.
ja_jp: このガイドでは、FunqyのAWS Lambda HTTPバインディングについて説明します。

source: This guide explains Funqy's AWS Lambda binding.
ja_jp: このガイドでは、FunqyのAWS Lambdaバインディングについて説明します。

source: This guide explains Funqy's Amazon Lambda HTTP binding.
ja_jp: FunqyのAmazon Lambda HTTPバインディングについて解説します。

source: This guide explains Funqy's Amazon Lambda binding.
ja_jp: FunqyのAmazon Lambdaバインディングについて解説しています。

source: This guide explains Funqy's Azure Functions HTTP binding.
ja_jp: このガイドでは、FunqyのAzure Functions HTTPバインディングについて説明します。

source: This guide explains Funqy's Google Cloud Platform Functions HTTP binding.
ja_jp: FunqyのGoogle Cloud Platform FunctionsのHTTPバインディングについて解説します。

source: This guide explains Funqy's Google Cloud Platform Functions binding.
ja_jp: FunqyのGoogle Cloud Platform Functionsバインディングについて解説しています。

source: This guide explains Funqy's HTTP binding.
ja_jp: このガイドでは、FunqyのHTTPバインディングについて説明します。

source: This guide explains Funqy's Knative Events binding.
ja_jp: このガイドでは、FunqyのKnative Eventsバインディングについて説明しています。

source: This guide explains basics of the Funqy framework, a simple portable cross-provider cloud function API.
ja_jp: このガイドでは、Funqyフレームワークの基本、シンプルなポータブルクロスプロバイダーCloud Function APIについて説明します。

source: This guide explains how JDK Flight Recorder (JFR) can be extended to provide additional insight into your Quarkus application.
ja_jp: このガイドでは、JDK Flight Recorder (JFR) を拡張して、Quarkus アプリケーションへの追加の洞察を提供する方法について説明します。

source: This guide explains how Java Flight Recorder (JFR) can be extended to provide additional insight into your Quarkus application.
ja_jp: このガイドでは、Java Flight Recorder（JFR）を拡張して、Quarkusアプリケーションをさらに詳しく把握する方法について説明します。

source: This guide explains how a Quarkus application can leverage the well known Dependency Injection annotations included in the Spring Framework.
ja_jp: このガイドでは、Spring Frameworkに含まれる有名なDependency InjectionアノテーションをQuarkusアプリケーションでどのように活用するかを説明します。

source: This guide explains how a Quarkus application can leverage the well known Spring Cache annotations to enable application data caching for their Spring beans.
ja_jp: このガイドでは、Quarkusアプリケーションが、よく知られているSpring Cacheアノテーションを活用して、Spring Beansのアプリケーションデータのキャッシングを可能にする方法を説明します。

source: This guide explains how a Quarkus application can leverage the well known Spring Scheduled annotation to configure and schedule tasks.
ja_jp: このガイドでは、よく知られているSpring Scheduledアノテーションを利用して、Quarkusアプリケーションがどのようにタスクを設定、スケジュールするかを説明します。

source: This guide explains how a Quarkus application can leverage the well known Spring Security annotations to define authorizations on RESTful services using roles.
ja_jp: このガイドでは、Quarkus アプリケーションがよく知られている Spring Security アノテーションを利用して、ロールを使用する RESTful サービスの承認を定義する方法について説明します。

source: This guide explains how a Quarkus application can leverage the well known Spring Web annotations to define RESTful services.
ja_jp: このガイドでは、よく知られているSpring Webアノテーションを利用して、QuarkusアプリケーションでRESTfulサービスを定義する方法を説明します。

source: This guide explains how a Quarkus application can leverage the well-known Spring Security annotations to define authorizations on RESTful services using roles.
ja_jp: このガイドでは、Quarkusアプリケーションで、よく知られているSpring Securityアノテーションを活用し、ロールを使用してRESTfulサービスの認可を定義する方法について説明します。

source: This guide explains how different beans can interact using the event bus.
ja_jp: このガイドでは、イベントバスを使用して異なるBeanがどのように相互作用するかを説明します。
